# ðŸŒŸ Exercise 1: Identifying Data Types

A companyâ€™s financial reports stored in an Excel file.(Structured)

Photographs uploaded to a social media platform.(Unstructured)

A collection of news articles on a website.(Unstructurd)

Inventory data in a relational database.(Structured)

Recorded interviews from a market research study.(Unstructurd)

# ðŸŒŸ Exercise 2: Transformation Exercise

- A series of blog posts about travel experiences: Convert to structured format using NLP and extract key information such as destination, dates, and experiences.
- Audio recordings of customer service calls: Convert to structured format using speech-to-text technology and categorize the data based on the type of issue or sentiment.
- Handwritten notes from a brainstorming session: Convert to structured format by transcribing the notes and organizing them into categories or themes.
- A video tutorial on cooking: Convert to structured format by extracting key steps, ingredients, and cooking times using video analysis tools.

# ðŸŒŸ Exercise 3 : Import a file from Kaggle

In [2]:
import pandas as pd
def_train = pd.read_csv('train.csv')

In [3]:
def_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# ðŸŒŸ Exercise 4: Importing a CSV File

In [5]:
df_iris = pd.read_csv('iris_dataset.csv')

In [6]:
df_iris.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

# ðŸŒŸ Exercise 5 : Export a dataframe to excel format and JSON format.

In [7]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 28],
    'City': ['New York', 'London', 'Paris', 'Tokyo']
}

df_data = pd.DataFrame(data)
print(df_data)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   28     Tokyo

In [12]:
df_data.to_excel('df_data.xlsx', index=False)

In [13]:
df_data.to_json('df_data.json')

# ðŸŒŸ Exercise 6: Reading JSON Data

In [15]:
df_json = pd.read_json("https://github.com/devtlv/Datasets-DA-Bootcamp-2-/raw/refs/heads/main/Week%204%20-%20Data%20Understanding/W4D3%20-%20Importing%20Data,%20Exporting%20D/posts.zip")

In [16]:
df_json.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...